greet = "Привет, {name}, я Dress~room бот, помогу тебе подобрать и примерить одежду не выходя из дома.\n Для генерации изображений бот использует нейросеть oot_diffusion🔮.\n\n\n Created by Chernika💙"


gen_wait = "⏳Пожалуйста, подождите немного, пока нейросеть обрабатывает фото..."


text_profile = 'Привет👋\nДавай заполним твой профиль. 👤\n\nЭти данные помогут нейросети сделать более чёткую обработку'
profile_text1 = "Напиши свой рост(см)"
profile_text2 = "Напиши свой вес(кг)"
profile_text3 = "Напиши размер обуви(Ru)"

admin_text = '{name}, приветствую в режиме Разработчика, вам доступны все функции бота🛡'

settings = '🧰 Меню настроек.'
web_app = 'Каталог создан для интеграции с интернет магазинами. Если у вас есть вопросы напишите в раздел тех. поддержки.'
helper = 'Правила пользования:\n1️⃣ Для более качественой обработки на фото должен быть белый фон.\n2️⃣ При покупке DRESSPREM сначала используюся бесплатные ежедневные обработки, а только потом токены.\n3️⃣ При не качественной обрабоке вы можете написать в поддержку, прикрепить скрин с обработкой и получить потраченные токены назад.'

tech = 'Если у вас появились какие-то тех. проблемы напишите нам 👇'

dress_new_text = '📷 У вас ещё нет фото для примерки.\nВнимание❗: Для лучшей обработки на фотографях должен быть белый фон. Подробнее в разделе "🔎 Помощь".'
dress_text = 'Вы хотите использовать фото, которое использовали ранее или изменить его?'
edit_foto = 'Отправьте фото...'
dress_true = 'Фото успешно сохранено ✅'
clothes_from_ur = 'Отправьте фото одежды которую хотите примерить'

prem_SILVER = 'Благодарим за покупку DRESSPREM GOLD.\n+5 бесплатных обработок каждый день.\n+1000 токенов на баланс.\n+9 слотов в галерею.'
premS_t = "DRESSPREM SILVER"
premS = '🔘3 бесплатных обработок в день\n🔘4 слота в галлерею\n🔘500 токенов на баланс'

prem_GOLD = 'Благодарим за покупку DRESSPREM GOLD.\n+5 бесплатных обработок каждый день.\n+1000 токенов на баланс.\n+9 слотов в галерею.'
premG_t = 'DRESSPREM GOLD'
premG = '🔘5 бесплатных обработок в день\n🔘9 слотов в галлерею\n🔘1000 токенов на баланс\n🔘Функция удаления фона фотографий для более корректной примерки (в разработке)'

prem_UPDATE = 'Вы обновились до DRESSPREM GOLD.\n🔘+2 бесплатных обработки в день\n🔘+5 слотов в галлерею\n🔘+500 токенов на баланс\n🔘+Функция удаления фона фотографий для более корректной примерки (в разработке)'
premU_t = 'DRESSPREM GOLD'
premU = '🔘5 бесплатных обработок в день\n🔘9 слотов в галлерею\n🔘500 токенов на баланс\n🔘Функция удаления фона фотографий для более корректной примерки (в разработке)'

shop_defult = "🛒 SHOP\n Здесь вы можете приобрести премиум подписки или пополнить баланс токенов.\nDRESSPREM SILVER(1 месяц):\n🔘3 бесплатных обработок в день\n🔘4 слота в галлерею\n🔘500 токенов на баланс\nDRESSPREM GOLD(1 месяц):\n🔘5 бесплатных обработок в день\n🔘9 слотов в галлерею\n🔘1000 токенов на баланс\n🔘Функция удаления фона фотографий для более корректной примерки"
shop_silver = "🛒 SHOP\n Здравствуйте, {name}, у вас уже приобретён DRESSPREM SILVER.\nВы можете обновить DRESSPREM SILVER до DRESSPREM GOLD или купить токены.\nDRESSPREM GOLD(1 месяц):\n🔘5 бесплатных обработок в день\n🔘9 слотов в галлерею\n🔘1000 токенов на баланс\n🔘Функция удаления фона фотографий для более корректной примерки (в разработке)"
shop_gold = "🛒 SHOP\n Здравствуйте, {name}, у вас уже приобретён DRESSPREM GOLD.\nВы можете купить токены."

buy_TOKENS = "Токены(⭐️) используются для генерации изображний.\nНа одну обработку тратится от 50 до 100 токенов, в зависимости от её сложности."
BuyT_t = '{tokens}⭐️'
BuyT = 'Токены: {tokens} шт. {col} обработок.|⭐️|'
buy_th = 'Благодарим за покупку {col} токенов. Хороших обработок 😇!'